// 특수코어 스킬명 -> Skill 매핑
const skillMap: Record<string, Skill> = {
  견뎌내기: {
    grade: '5',
    name: '견뎌내기',
    level: 1,
    icon: '',
    effect:
      '100회 피격당할 때마다 10초 동안 무적 / 30초당 1번만 발동 / 30초 이내에 피격 횟수가 누적되지 않으면 카운트 초기화',
  },
  '견뎌내기 II': {
    grade: '5',
    name: '견뎌내기 II',
    level: 1,
    icon: '',
    effect:
      '100회 피격당할 때마다 재사용 대기시간 감소 및 초기화의 영향을 받지 않는 스킬을 제외한 스킬의 남은 재사용 대기시간 20% 감소 / 60초당 1번만 발동 / 60초 이내에 피격 횟수가 누적되지 않으면 카운트 초기화',
  },
  '극복하는 경험 I': {
    grade: '5',
    name: '극복하는 경험 I',
    level: 1,
    icon: '',
    effect:
      '100회 피격당할 때마다 20초 동안 경험치 획득량 50% 증가 / 30초당 1번만 발동 / 30초 이내에 피격 횟수가 누적되지 않으면 카운트 초기화',
  },
  '근성 I': {
    grade: '5',
    name: '근성 I',
    level: 1,
    icon: '',
    effect:
      '100회 피격당할 때마다 모든 스킬의 남은 재사용 대기시간 25% 감소 / 30초당 1번만 발동 / 30초 이내에 피격 횟수가 누적되지 않으면 카운트 초기화',
  },
  '반격 I': {
    grade: '5',
    name: '반격 I',
    level: 1,
    icon: '',
    effect:
      '20회 피격당할 때마다 2초 동안 데미지 100% 증가 / 30초당 1번만 발동 / 30초 이내에 피격 횟수가 누적되지 않으면 카운트 초기화',
  },
  '방어구 부수기 I': {
    grade: '5',
    name: '방어구 부수기 I',
    level: 1,
    icon: '',
    effect:
      '같은 몬스터를 800회(스킬의 공격 횟수 당 1회) 공격하면 10초 동안 방어율 무시 100% 증가 / 60초당 1번만 발동 / 30초 이내에 공격 횟수가 누적되지 않으면 카운트 초기화',
  },
  '치명적인 일격 I': {
    grade: '5',
    name: '치명적인 일격 I',
    level: 1,
    icon: '',
    effect:
      '공격 횟수 1000회마다 크리티컬 확률 10초 동안 100% 증가 / 60초당 1번만 발동 / 30초 이내에 공격 횟수가 누적되지 않으면 카운트 초기화',
  },
  '한놈만 I': {
    grade: '5',
    name: '한놈만 I',
    level: 1,
    icon: '',
    effect:
      '같은 몬스터를 800회(스킬의 공격 횟수 당 1회) 공격하면 10초 동안 크리티컬 확률 100% 증가 / 60초당 1번만 발동 / 30초 이내에 공격 횟수가 누적되지 않으면 카운트 초기화',
  },
  '룬의 가호': {
    grade: '5',
    name: '룬의 가호',
    level: 1,
    icon: '',
    effect: '룬을 발동시킬 때마다 10초 동안 무적 / 10초당 1번만 발동',
  },
  '룬의 경험 I': {
    grade: '5',
    name: '룬의 경험 I',
    level: 1,
    icon: '',
    effect: '룬을 발동시킬 때마다 20초 동안 경험치 획득량 50% 증가',
  },
  '룬의 폭주': {
    grade: '5',
    name: '룬의 폭주',
    level: 1,
    icon: '',
    effect:
      '룬을 발동시킬 때마다 10초 동안 데미지100% 증가 / 10초당 1번만 발동',
  },
  '끊임없는 공격': {
    grade: '5',
    name: '끊임없는 공격',
    level: 1,
    icon: '',
    effect:
      '콤보킬이 50의 배수일 때마다 재사용 대기시간 감소 및 초기화의 영향을 받지 않는 스킬을 제외한 스킬의 남은 재사용 대기시간 20% 감소 / 75초당 1번만 발동 / 10초 이내에 콤보킬 횟수가 누적되지 않으면 카운트 초기화',
  },
  '연속된 일격 I': {
    grade: '5',
    name: '연속된 일격 I',
    level: 1,
    icon: '',
    effect:
      '콤보킬이 50의 배수일 때마다 10초 동안 크리티컬 데미지 100% 증가 / 30초당 1번만 발동 / 10초 이내에 콤보킬이 누적되지 않으면 카운트 초기화',
  },
  '치명적인 일격 II': {
    grade: '5',
    name: '치명적인 일격 II',
    level: 2,
    icon: '',
    effect:
      '콤보킬이 50의 배수일 때마다 10초 동안 크리티컬 확률 100% 증가 / 60초당 1번만 발동 / 10초 이내에 콤보킬 횟수가 누적되지 않으면 카운트 초기화',
  },
  '보스 슬레이어 I': {
    grade: '5',
    name: '보스 슬레이어 I',
    level: 1,
    icon: '',
    effect:
      '공격 시 0.1% 확률로 10초 동안 보스 몬스터 공격 시 데미지 50% 증가 / 30초당 1번만 발동',
  },
  '운 좋은 회복 I': {
    grade: '5',
    name: '운 좋은 회복 I',
    level: 1,
    icon: '',
    effect: '공격 시 1% 확률로 HP 10% 회복 / 10초당 1번만 발동',
  },
  '일격필살 I': {
    grade: '5',
    name: '일격필살 I',
    level: 1,
    icon: '',
    effect: '30초마다 공격 시 2초 동안 데미지 100% 증가',
  },
  '방어구 부수기 II': {
    grade: '5',
    name: '방어구 부수기 II',
    level: 2,
    icon: '',
    effect: '120초마다 스킬 사용 시 10초 동안 방어율 무시 100%',
  },
  '보스 슬레이어 II': {
    grade: '5',
    name: '보스 슬레이어 II',
    level: 2,
    icon: '',
    effect:
      '120초마다 스킬 사용 시 10초 동안 보스 몬스터 공격 시 데미지 50% 증가',
  },
  자동회복: {
    grade: '5',
    name: '자동회복',
    level: 1,
    icon: '',
    effect: '40초마다 스킬 사용시 HP 100% 회복',
  },
  '자동회복 II': {
    grade: '5',
    name: '자동회복 II',
    level: 1,
    icon: '',
    effect: '30초마다 스킬 사용시 HP 100% 회복',
  },
  '보스 슬레이어 III': {
    grade: '5',
    name: '보스 슬레이어 III',
    level: 3,
    icon: '',
    effect:
      '적을 30명 쓰러뜨릴 때 10초 동안 보스 몬스터 공격 시 데미지 50% 증가 / 10초당 1번만 발동 / 30초 이내에 적을 쓰러뜨린 횟수가 누적되지 않으면 카운트 초기화',
  },
  '폭주하는 힘 I': {
    grade: '5',
    name: '폭주하는 힘 I',
    level: 1,
    icon: '',
    effect:
      '적을 120명 쓰러뜨릴 때 10초 동안 데미지 20% 증가 / 60초당 1번만 발동 / 30초 이내에 적을 쓰러뜨린 횟수가 누적되지 않으면 카운트 초기화',
  },
  '컴 백 I': {
    grade: '5',
    name: '컴 백 I',
    level: 1,
    icon: '',
    effect:
      '사망 시 재사용 대기시간 감소 및 초기화의 영향을 받지 않는 스킬을 제외한 스킬의 남은 재사용 대기시간 20% 감소 / 60초당 1번만 발동',
  },
  '컴 백 II': {
    grade: '5',
    name: '컴 백 II',
    level: 1,
    icon: '',
    effect:
      '사망 시 재사용 대기시간 감소 및 초기화의 영향을 받지 않는 스킬을 제외한 스킬의 남은 재사용 대기시간 30% 감소 / 60초당 1번만 발동',
  },
}

export const getVSkillInfo = (name: string) => {
  return skillMap[name]
}
